{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.03/4.5"
      ],
      "degree": "Graduate diploma, Computer Science",
      "department": "Department of Computer Science and Software Engineering",
      "duration": "2018-2021",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": [
        "GPA: 3.14/4.5"
      ],
      "degree": "Bachelor of Fine Art",
      "department": "Mel Hoppenheim School of Cinema",
      "duration": "2011-2014",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "School of Metallurgy and Materials Engineering",
      "duration": "1993-1998",
      "school_name": "Iran University of Science and Technology"
    }
  ],
  "github_repo_root_url": "https://github/Jarvis-Consulting-Group/jarvis_data_eng-h-sabouri",
  "highlighted_projects": [
    {
      "description": "Create a Utilities package including some modules to use in compositing jobs in VFX and add those functionalities in Nuke software interface. Those modules include renderFinished, exposeInFinder, readWrite. By using Python, Nuke Library, The Foundry Nuke, PyCharm.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Create some nuke plugins using Nuke Package"
    },
    {
      "description": "Utilizing Concordia University Engineering and Computer Science MYSQL DBMS server, to develop a university database system with several relation by using SQL, PHP",
      "git_url": null,
      "name": "Develop a university database system"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Deployed a project to collect hardware specification and also monitor the cluster nodes resource usage in real time. The collected data will be stored in an RDBMS database for this we use posgres sql database. The data can help to manage reports for future resource planning purposes.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Not Started",
        "JDBC App: Not Started.",
        "Grep App: Not Started."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Hossein Sabouri",
  "others": [
    {
      "bullets": [
        "Microsoft Certified: Azure AI Fundamentals"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Tennis player",
        "Soccer player, as a soccer player, I relly enjoy how my contribution can help to the team success through my growing individual skills.",
        "Cinephile"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "National Bank of Canada",
      "description": "Working on a project to access and store secrets in the Vault, using tools; Springboot API Java, IntllijIDE. Working on Udemy courses including Terraform, AWS Practitioner, Spring Boot. Agile/Scrum environment used for delivering worked.",
      "duration": "August 2023 - October 2023",
      "title": "Junior web developer"
    },
    {
      "company": "Jarvis",
      "description": "Developed multiple software application and worked on projects using Linux Bash, Docker and more. Agile/Scrum was used to collaborate with team. Git was utilized for version control on projects.",
      "duration": "2023-present",
      "title": "QA Analyst"
    },
    {
      "company": "Morgan \u0026 Stanley",
      "description": "Analysed requirements and performed functional and regression tests based on developers instruction. Executed TCM to deploy new changes and created test cases for different scenarios. Delivered work using Agile (Kanban) methodologies, ensuring that all work was on track and met necessary deadlines.",
      "duration": "2022-2023",
      "title": "QA Analyst"
    },
    {
      "company": "Double Negative",
      "description": "Combined visual elements from separated sources into single image by Nuke in Linux environment. Worked with software Nuke and Fusion, Conversion 2D image to 3D. Harvested Nuke script in order to extract the layer image elements.",
      "duration": "2017-2021",
      "title": "Image Compositor"
    }
  ],
  "skills": {
    "competent": [
      "Jira",
      "Docker",
      "N/A",
      "N/A",
      "N/A"
    ],
    "familiar": [
      "Springboot",
      "AWS",
      "Selenium",
      "REST APIs",
      "C++"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Git"
    ]
  },
  "summary": "Using Nuke as a main software when I was working for visual effect companies for a couple of years attracted me to the computer science. I honed my computer skills by graduating from Concordia University with a Graduate Diploma in Computer Science degree. Gained my quality assurance analyst expertise by joining to Morgan \u0026 Stanley company which gave me the opportunity to hand-on experience working closely with full-stack features teams to deliver complete components for boarder platform integration and leveraged various technologies and tools, including LINUX, SQL, GIT Bitbuckets, Object Oriented Programming (OOP), and delivered work using Agile (Kanban) methodologies, analyzed requirement and performed functional and regression tests based on developer instruction. Later, I started working as Junior Web Developer on site National Bank of Canada. Through using Java, Springboot, git bucket, Vault and Scrum as a methodology management, I worked in a project which created and stored secrets keys in the Vault and delivered work using Agile/ Scrum."
}
